# 14: Menggabungkan (merge) dua Data Frame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [6]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0  15   4   4  19  19
1   6   2   2   4   1
2  19  16   8  12  12
3   4  10   3   7   5
4  10   9  18  16   1

In [3]:
df1 = df.copy(deep = True) #potongan tabel pertama/df1
df1 = df1.drop([1, 4])
df1

    A   B   C  D   E
0  14   8   9  9   2
2  19   2   1  3  10
3   6  13  14  9  12

In [4]:
df2 = df.copy(deep = True) #potongan tabel kedua/df2
df2 = df2.drop([0, 3])
df2

    A   B   C  D   E
1  18  10   3  2  12
2  19   2   1  3  10
4  19  16  11  2   8

### Menggabungkan dua Data Frame

In [7]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A  B  C  D   E
0  19  2  1  3  10

In [8]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C  D   E
0  14   8   9  9   2
1  19   2   1  3  10
2   6  13  14  9  12
3  18  10   3  2  12
4  19  16  11  2   8